[
	{
		"category": "functional",
		"description": "Backend - Add tasks_update_text command",
		"steps": [
			"In commands.rs: create tasks_update_text command that takes id and text parameters",
			"Validate that text is not empty",
			"Find task by id, return error if not found",
			"Update task.text with new value",
			"Save to JSON and return Ok(())",
			"In lib.rs: register tasks_update_text in invoke_handler",
			"Run cargo check to verify compilation"
		],
		"shouldCommit": true,
		"passes": true,
		"notes": "Follow the same pattern as tasks_update_status. This enables editing task names from the frontend."
	},
	{
		"category": "functional",
		"description": "Frontend Hook - Add updateTaskText function",
		"steps": [
			"In useTasksStorage.ts: add updateTaskText to UseTasksStorageReturn interface",
			"Implement updateTaskText(id: string, text: string): optimistic update, invoke 'tasks_update_text', rollback on error",
			"Follow existing pattern from updateTaskStatus for optimistic updates",
			"Add updateTaskText to the return object",
			"Run bun tsc --noEmit to verify"
		],
		"shouldCommit": true,
		"passes": true,
		"notes": "Simple addition following existing patterns. The optimistic update pattern is already established in the hook."
	},
	{
		"category": "functional",
		"description": "State and Navigation - Add task detail view infrastructure",
		"steps": [
			"In TasksPlugin.tsx: expand TasksView type to include 'task': type TasksView = 'folders' | 'list' | 'task'",
			"Add state: const [currentTaskId, setCurrentTaskId] = useState<string | null>(null)",
			"Derive currentTask from tasks array: const currentTask = currentTaskId ? tasks.find(t => t.id === currentTaskId) : null",
			"Add handleNavigateToTask(taskId: string): sets currentTaskId, sets view to 'task'",
			"Add handleNavigateToList(): sets currentTaskId to null, sets view to 'list'",
			"Update useNavigationLevels to include third level when currentTask exists",
			"The third level should have id: `task-${currentTaskId}`, label: currentTask.text (truncated if needed)",
			"Add onNavigate callback to folder level to call handleNavigateToList",
			"Run bun tsc --noEmit to verify"
		],
		"shouldCommit": true,
		"passes": true,
		"notes": "This establishes the navigation foundation. The breadcrumb will show: jubby / Tasks / {folderName} / {taskName}. Clicking folder in breadcrumb returns to list view."
	},
	{
		"category": "functional",
		"description": "Modify TasksPluginItem - Remove inline subtasks, add click navigation",
		"steps": [
			"Remove isExpanded state from TasksPluginItem",
			"Remove TasksPluginSubtaskSection from TasksPluginItem render",
			"Remove subtask-related props from TasksPluginItemProps: onCreateSubtask, onToggleSubtask, onDeleteSubtask, onReorderSubtasks",
			"Keep TasksPluginProgressBadge - it shows the subtask count (e.g., '2/5')",
			"Add onTaskClick prop to TasksPluginItemProps: (taskId: string) => void",
			"Make the task text/row clickable to trigger onTaskClick(task.id)",
			"Add cursor-pointer and hover state to indicate clickability",
			"Update TasksPluginList to pass onTaskClick prop to TasksPluginItem",
			"Update TasksPluginList props to include onTaskClick",
			"Run bun tsc --noEmit to verify"
		],
		"shouldCommit": true,
		"passes": false,
		"notes": "Subtasks move from inline display to dedicated detail view. The progress badge remains visible to show subtask status at a glance."
	},
	{
		"category": "functional",
		"description": "Create TasksPluginTaskDetail component - Layout structure",
		"steps": [
			"Create TasksPluginTaskDetail component with props: task, tags, all subtask operations, onDeleteTask, onUpdateTaskStatus, onUpdateTaskText, onSetTaskTags",
			"Layout structure: Breadcrumb at top (already handled by parent), then scrollable content area",
			"Add 'TASK' section header with delete button aligned to the right",
			"Delete button uses existing two-click pattern (usePendingDelete hook)",
			"When delete confirmed: call onDeleteTask, then navigate back to list",
			"Add 'SUBTASKS' section header below task info",
			"Use same header styling as existing: text-[12px] font-medium text-white/40 uppercase tracking-wide",
			"No borders between sections - only headers as visual separators",
			"Run bun tsc --noEmit to verify"
		],
		"shouldCommit": true,
		"passes": false,
		"notes": "USE THE frontend-design SKILL. Focus on clean layout with headers as separators, not borders. Delete button should be subtle but accessible."
	},
	{
		"category": "functional",
		"description": "TasksPluginTaskDetail - Task info section with inline editing",
		"steps": [
			"Create TasksPluginTaskInfo sub-component for the task details",
			"Display status checkbox (reuse existing toggle logic with 3 states)",
			"Display task text with edit icon (Pencil from lucide) always aligned to the right",
			"Use flex layout: checkbox | text (flex-1 truncate) | edit button (shrink-0)",
			"Add isEditing state for inline text editing",
			"Click on edit icon or text: switch to input mode",
			"Input mode: show input field with current text, auto-focus and select all",
			"Enter key: save changes via onUpdateTaskText, exit edit mode",
			"Escape key: cancel edit, restore original text, exit edit mode",
			"Click outside: save changes and exit edit mode",
			"Display tags below text (reuse TasksPluginTagBadge components)",
			"Tags should be clickable to open tag editor popover (reuse existing pattern)",
			"Run bun tsc --noEmit to verify"
		],
		"shouldCommit": true,
		"passes": false,
		"notes": "USE THE frontend-design SKILL. Edit icon must always be at the far right regardless of text length. Inline editing should feel smooth and responsive."
	},
	{
		"category": "functional",
		"description": "TasksPluginTaskDetail - Subtasks section with input on top",
		"steps": [
			"Place TasksPluginSubtaskInput at the TOP of subtasks section (before the list)",
			"Reuse existing TasksPluginSubtaskInput component",
			"Reuse existing TasksPluginSubtaskList component below the input",
			"Pass all subtask operations: onCreateSubtask, onToggleSubtask, onDeleteSubtask, onReorderSubtasks",
			"Subtasks appear below input in order (new subtasks will appear at the end of the list)",
			"Run bun tsc --noEmit to verify"
		],
		"shouldCommit": true,
		"passes": true,
		"notes": "Input on top is better UX - always visible without scrolling. Reuse existing subtask components, just reorganize their placement."
	},
	{
		"category": "functional",
		"description": "TasksPluginSubtaskItem - Add inline text editing",
		"steps": [
			"Add onUpdateText prop to TasksPluginSubtaskItemProps: (text: string) => void",
			"Add isEditing state to TasksPluginSubtaskItem",
			"Add edit button (Pencil icon) always aligned to the right after delete button",
			"Use flex layout: drag handle | checkbox | text (flex-1 truncate) | edit button (shrink-0) | delete button (shrink-0)",
			"Click on edit icon: switch to input mode",
			"Input mode: replace text span with input field, auto-focus and select all",
			"Enter key: save changes via onUpdateText, exit edit mode",
			"Escape key: cancel edit, restore original text, exit edit mode",
			"Click outside (onBlur): save changes and exit edit mode",
			"Update TasksPluginSubtaskList to pass onUpdateText to each item",
			"Run bun tsc --noEmit to verify"
		],
		"shouldCommit": true,
		"passes": true,
		"notes": "USE THE frontend-design SKILL. Edit icon must always be at the far right. Follow same inline editing pattern as task text editing for consistency."
	},
	{
		"category": "functional",
		"description": "Wire up TasksPluginTaskDetail in main component",
		"steps": [
			"In TasksPlugin: add conditional render for view === 'task'",
			"Render TasksPluginTaskDetail when view is 'task' and currentTask exists",
			"Pass all required props: task (currentTask), tags, all subtask operations from useTasksStorage",
			"Pass updateTaskText, updateTaskStatus, setTaskTags, deleteTask from useTasksStorage",
			"Handle delete: when task is deleted, automatically navigate back to list (handleNavigateToList)",
			"Update the main list view: pass onTaskClick={handleNavigateToTask} to TasksPluginList",
			"Ensure Breadcrumb is rendered in task detail view (same pattern as list view)",
			"Run bun tsc --noEmit to verify"
		],
		"shouldCommit": true,
		"passes": true,
		"notes": "This connects everything together. The navigation flow should be seamless: click task -> detail view -> breadcrumb or delete -> back to list."
	},
	{
		"category": "test",
		"description": "Verify implementation - Manual testing",
		"steps": [
			"Verify cargo check passes with no errors",
			"Verify bun tsc --noEmit passes with no errors",
			"Test clicking a task navigates to detail view",
			"Test breadcrumb shows correct path: jubby / Tasks / {folder} / {task}",
			"Test clicking folder in breadcrumb returns to list view",
			"Test editing task text: click edit icon, modify, press Enter",
			"Test editing task text: press Escape cancels edit",
			"Test editing subtask text: same behavior as task text",
			"Test delete task: two-click confirmation, returns to list",
			"Test adding subtask: input at top works correctly",
			"Test subtask operations: toggle, delete, drag reorder all work",
			"Test status toggle: cycles through pending -> in_progress -> completed",
			"Test tag editing: click tags opens popover, can add/remove tags",
			"Test progress badge still shows in list view (e.g., '2/5')"
		],
		"shouldCommit": false,
		"passes": false,
		"notes": "Manual testing required. Test the full navigation flow and all editing scenarios. Verify UX is smooth and responsive."
	}
]
